package com.ran.test;

public class Demo14 {
    public static void main(String[] args) {
        //位运算符
        // << 左移
        //把运算符左边的操作数转换成二进制数,再左移运算符右边的数,位数不够右补0
        System.out.println(5<<2);//101-->10100-->20
        // >> 右移
        //把运算符左边的操作数转换成二进制数,再右移运算符右边的数,超出的部分去除
        System.out.println(5>>2);//101-->1-->1

        // & 位与
        //运算符两边的数转换成二进制数,位数对齐,有0则为0,全1才为1;
        System.out.println(5&3);//101   11 -->1

        // | 位或
        //运算符两边的数转换成二进制数,位数对齐,有1则为1,全0才为0
        System.out.println(5|3);//101 11 -->111-->7

        // ^ 位异或
        //运算符两边的数转换成二进制数,位数对齐,相同则为0,不同则为1
        System.out.println(5^4);// 101  100 --> 001-->1
    }
}
